selectah_backend/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    song = Song.find_by(id: params[:id])